# Kap5: Pandas
S.127

Inhalt:
- test

## 5.1: pandas-Datenstrukturen
values + index
- Series
- DataFrames

In [147]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

### 5.1.1 - Series

In [148]:
obj = pd.Series([4,7,-5,3])
obj
obj.values
obj.index

0    4
1    7
2   -5
3    3
dtype: int64

array([ 4,  7, -5,  3], dtype=int64)

RangeIndex(start=0, stop=4, step=1)

In [149]:
obj2 = pd.Series([2,5,-1,-8], index=['d','b','a','c'])
obj2
obj2.index

d    2
b    5
a   -1
c   -8
dtype: int64

Index(['d', 'b', 'a', 'c'], dtype='object')

In [150]:
np.exp(obj2)     # Zusammenhang mit Indizes bleibt erhalten!

obj2['b']        # Zugriff mittels Index

'b' in obj2

d      7.389056
b    148.413159
a      0.367879
c      0.000335
dtype: float64

5

True

**dict --> series**
- pd.Series()

In [151]:
# Series aus dict erstellen
sdata = {'Ohio':35000, 'Texas':71000,'Oregon':16000, 'Utah':5000}
sdata
obj3 = pd.Series(sdata)
obj3

# index selber Ã¼bergeben
print()
print('obj4:')
obj4 = pd.Series(sdata, index=['Califaronia', 'Utah', 'Ohio'])
obj4

# 
obj3 + obj4

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

obj4:

Califaronia        NaN
Utah            5000.0
Ohio           35000.0
dtype: float64

Califaronia        NaN
Ohio           70000.0
Oregon             NaN
Texas              NaN
Utah           10000.0
dtype: float64

**fehlende Daten finden**
- pd.isnull()

In [152]:
pd.isnull(obj4)

Califaronia     True
Utah           False
Ohio           False
dtype: bool

**Index & Name**

In [153]:
obj4.name = 'Population'
obj4.index.name = 'states'
obj4

states
Califaronia        NaN
Utah            5000.0
Ohio           35000.0
Name: Population, dtype: float64

### 5.1.2 - DataFrames
- Erstellen
- Spalten / Zeilen aufrufen
- Zuweisungen

**Erstellen**

In [154]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
       'year':[2000,2001,2002,2000,2001,2002],
       'pop':['1.5','1,7','3.6','2.4','2.9','3.1']}
df1 = pd.DataFrame(data)
df1.head(2)

df2 = pd.DataFrame(data, columns=['year','state','pop'])
df2

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1,7

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1,7
2  2002    Ohio  3.6
3  2000  Nevada  2.4
4  2001  Nevada  2.9
5  2002  Nevada  3.1

**Spalten / Zeilen aufrufen**

In [155]:
# Spalten aufrufen
df1.head(4)
df1['state']  # dict style
df1.state  # Series style

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1,7
2    Ohio  2002  3.6
3  Nevada  2000  2.4

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [156]:
# Zeilen aufrufen
df1.loc[4]

state    Nevada
year       2001
pop         2.9
Name: 4, dtype: object

**Erstellen und LÃ¶schen von Spalten**

In [157]:
# Erstellen
df2['dept'] = np.arange(6.0)
val = pd.Series([-1.3,4.3,2.3], index=[2,4,5])
df2['test'] = val

print()
print(df2)

   year   state  pop  dept  test
0  2000    Ohio  1.5   0.0   NaN
1  2001    Ohio  1,7   1.0   NaN
2  2002    Ohio  3.6   2.0  -1.3
3  2000  Nevada  2.4   3.0   NaN
4  2001  Nevada  2.9   4.0   4.3
5  2002  Nevada  3.1   5.0   2.3

In [158]:
del df2['test']
df2.head(2)

   year state  pop  dept
0  2000  Ohio  1.5   0.0
1  2001  Ohio  1,7   1.0

### 5.1.3 - Indexobjekt

In [159]:
df2.index
df2.columns
'pop' in df2.columns
2003 in df2.index

RangeIndex(start=0, stop=6, step=1)

Index(['year', 'state', 'pop', 'dept'], dtype='object')

True

False

## 5.2 Funktionalitaet

Interaktion von Daten in Series oder DataFrames.

### 5.2.1 - Neuindizierung

In [160]:
# using reindex
df2
df2.reindex(np.arange(5,-1,-1)).head(3)
df2.reindex([4,0,1]).head(3)

   year   state  pop  dept
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1,7   1.0
2  2002    Ohio  3.6   2.0
3  2000  Nevada  2.4   3.0
4  2001  Nevada  2.9   4.0
5  2002  Nevada  3.1   5.0

   year   state  pop  dept
5  2002  Nevada  3.1   5.0
4  2001  Nevada  2.9   4.0
3  2000  Nevada  2.4   3.0

   year   state  pop  dept
4  2001  Nevada  2.9   4.0
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1,7   1.0

In [161]:
# creating new dataframe
pd.DataFrame(df2, columns = ['anus', 'dept','state'], index = range(9))

   anus  dept   state
0   NaN   0.0    Ohio
1   NaN   1.0    Ohio
2   NaN   2.0    Ohio
3   NaN   3.0  Nevada
4   NaN   4.0  Nevada
5   NaN   5.0  Nevada
6   NaN   NaN     NaN
7   NaN   NaN     NaN
8   NaN   NaN     NaN

In [171]:
# using 'loc' for reindexing index AND columns
# df2.loc[[2,3,4,7,0], ['penis', 'state']]
df2.loc[[2,3,4,7,0], ['penis', 'state']]

   penis   state
2    NaN    Ohio
3    NaN  Nevada
4    NaN  Nevada
7    NaN     NaN
0    NaN    Ohio

### 5.2.2 - Achsen lÃ¶schen

In [172]:
# raw data:
ser = pd.Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])
ser
dat = pd.DataFrame(np.arange(16).reshape(4,4), index = ['Ohio', 'Colorado', 'Utah', 'NewYork'],
                 columns = ['one', 'two', 'three', 'four'])
dat

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [173]:
# drop rows from series
ser.drop(['c','e'])

# drop rows from dataframe
dat.drop(['Ohio','Utah'], axis = 0) 
dat.drop(['three'],axis = 1)

a    0.0
b    1.0
d    3.0
dtype: float64

          one  two  three  four
Colorado    4    5      6     7
NewYork    12   13     14    15

          one  two  four
Ohio        0    1     3
Colorado    4    5     7
Utah        8    9    11
NewYork    12   13    15

### 5.2.3 - Indizierung und Auswahl

In [174]:
dat.loc['Colorado', ['two','one']]
dat.loc[['Colorado', 'Utah'], ['two','one']]

two    5
one    4
Name: Colorado, dtype: int32

          two  one
Colorado    5    4
Utah        9    8